using MiniLibraryManagementSystem.Data;
using MiniLibraryManagementSystem.Models;

namespace MiniLibraryManagementSystem.SeedData
{
    public class SeedingData
    {
        private readonly ApplicationDbContext _context;
        public SeedingData(ApplicationDbContext context)
        {
            _context = context;
        }
        public void Seed()
        {
            SeedBooks();
            SeedAuthor();
            SeedBookAuthor();
            _context.SaveChanges();
        }
        private void SeedBooks()
        {
            var Book1 = new List<Book>
            {
                  new Book
                  {
                        Title = "Reflection (A Twisted Tale)",
                        Description = "What if Mulan had to travel to the Underworld? When Captain Shang is mortally wounded by Shan Yu in battle, Mulan must travel to the Underworld, Diyu, in order to save him from certain death. But King Yama, the ruler of Diyu, is not willing to give Shang up easily. With the help of Shang's great lion guardian ShiShi, Mulan must traverse Diyu to find Shang's spirit, face harrowing obstacles, and leave by sunrise⁠—or become King Yama's prisoner forever. Moreover, Mulan is still disguised as the soldier called Ping, wrestling with the decision to reveal her true identity to her closest friend. Will Mulan be able to save Shang before it's too late? Will he ever be able to trust her again? Or will she lose him--and be lost in the Underworld⁠—forever?",
                        ISBN = "3718012518549",
                        PublicationYear = new DateTime(2018, 3, 27),
                        AvailableCopies = 5,
                        Price = 594,
                    },
                  new Book
                  {
                        Title = "Part of Your World (A Twisted Tale)",
                        Description = "It’s been five years since the infamous sea witch defeated the little mermaid . . . taking King Triton’s life in the process. Ariel is now the voiceless queen of Atlantica, while Ursula runs Prince Eric’s kingdom on land. But when Ariel discovers that her father might still be alive, she finds herself returning to a world, and a prince, she never imagined she would see again. Will Ariel be able to overthrow the murderous villain set on destroying her home and the world she one longed to be a part of?",
                        ISBN = "7336053665327",
                        PublicationYear = new DateTime(2018, 9, 4),
                        AvailableCopies = 3,
                        Price = 594,
                    },
                  new Book
                  {
                        Title = "(الحرب والسلم (4 أجزاء",
                        Description = "الحرب والسلم (4 أجزاء) بقلم ليو تولستوي ... لقد اشتهر (تولستوي) بأنه أحد كبار الكتاب الروس وخصوصًا مع روايته العالمية (الحرب و السلم)، هذه الرواية الأسطورية من أبدع ما كتب هذا الأديب، وهي نموذج للحكايات التاريخية الكبيرة للقرن العشرين وتدور حول الأحداث الكبيرة التي حدثت في بداية القرن التاسع عشر،وقد حدت الحياة السياسية و الحب و الكراهية التي كانت سائدة آنداك كما انها سلطت الضوء على حياة الترف التي كانت تعيشها طبقت النبلاء في ذلك العصر،كل ذلك جسده تولستوي ضمن شخصيات عديدة رئيسية وثانوية و تاريخية. ",
                        ISBN = "9782843091223",
                        PublicationYear = new DateTime(1869, 3, 4),
                        AvailableCopies = 6,
                        Price = 3000,
                    },
                  new Book
                  {
                        Title = "إيفان المغفل وقصص أخري",
                        Description = "إيفان المغفل وقصص أخري بقلم ليو تولستوي ... مجموعة قصص للكاتب ليو تولستوي تعكس رؤيته الأخلاقية والفلسفية العميقة للتجرية الإنسانية.تستكشف كل حكاية موضوعات أساسية مثل الحب والرحمة والفداء والبحث عن الحقيقة. من خلال شخصيات يمكن التعاطق معها وسرد بسيط وعميق، يدعو تولستوي القراء إلى التأمل في طبيعة الوجود وأهمية السلوك الأخلاقي وتعقيدات الحياة. تعمل القصص، التي تتميز بالوضوح وسهولة الوصول إليها، كدروس أخلاقية تشجع على التأمل الذاتي وتسلط الضوء على أهمية عيش حياة تسترشد باللطف والتعاطف. تعرض هذه المجموعة تطور تولستوي كمفكر وكاتب مع التأكيد على أهمية رسائله الدائمة.",
                        PublicationYear = new DateTime(1885, 1, 1),
                        AvailableCopies = 0,
                        Price = 250,
                  },
                  new Book
                  {
                        Title = "آنا كارينينا",
                        Description = "آنا كارينينا بقلم ليو تولستوي ... إصدارات معرض القاهرة 2022",
                        ISBN = "9789774281198",
                        AvailableCopies = 3,
                        Price = 198,
                  },
                  new Book
                  {
                        Title = "كل هذا بسبب الملوخية",
                        Description = "كل هذا بسبب الملوخية بقلم سمر طاهر ... قالت أمي.. قالت جدتي.. قال أبي.. قالت عمتي! نسمع حكايات من هنا وهناك فنختار أن نصدقها، بعضها أو كلها، وقد نكتفي باستمتاعنا بها. وقد نختار أن نكتب نحن قصصا أخرى، قصصًا خاصة بنا. یا ترى، ما قصة فؤاد مع الملوخية؟ وما هي أصلا حكاية الملوخية؟ !",
                        ISBN = "9789770939086",
                        AvailableCopies = 3,
                        Price = 170,
                  },
                  new Book
                  {
                        Title = "رسائل هاشم وحليمة",
                        Description = "ما بين بورسعيد والجمَّاليَّة في عام 1945، يبدأ جُنون حُب، وتُسافر رسائل هاشم وحليمة في رحلة غير مسبوقة على سُحب الصبر، وتتصاعد حِدَّة مشاعرها المخطوطة على درجات قوس قزح بألوانه السبع. تتقابل قصص العشق بمُفترقات الطُّرق. يصطدم شُخُوصها بعوائق كما موانع شَتَّى، وتمتزج حكايات أبطالها بحبكةٍ تكتبها الأقدار، فتُقرِّب غريبًا، وتُقصي قريبًا، بينما تُحلِّق رسائل هاشم وحليمة في سماء الغرام. فهل تصل في الميعاد؟ أم ستُلاقي مصيرًا لم يتوقَّعه أحدٌ؟",
                        ISBN = "9789779923376",
                        AvailableCopies = 3,
                        Price = 250,
                  },
                  new Book
                  {
                        Title = "الطنطورية",
                        Description = " «إنه عمل مهم، وجرأة نادرة.... من يقرأ هذا الكتاب يعرف ما معنى النكبة، وما معنى خسارة الوطن، وما معنى اللجوء، وما معنى حياة اللجوء على أرض الوطن نفسه، قبل اللجوء إلى سواه. إنه هرم من حكايات الناس. المؤرخة اللبنانية. د.بيان نويهض الحوت – جريدة السفير «رواية رضوى عاشور الجميلة الجديدة \"الطنطورية\" هي... من هذا النوع من الروايات النادرة التي تغنيك قراءتها عن قراءة عدد من المراجع الكثيرة والمتنوعة عن فلسطين....: تاريخها، قراها، عذابات أهلها وصمودهم، مأثوراتها الشعبية، لغتها، أغانيها وأهازيجها، أشجارها وزرعها ومحاصيلها، ورموزها، وما جرى لأهلها الذين أجبروا على النزوح منها بالعسف والبطش والتطهير العرقي والتقتيل». د.صبري حافظ– جريدة الشروق «في رواية \"الطنطورية\" لا تحكي رضوي عاشور سيرة رقية فحسب بل تحقق بالسرد نصرا مبينا فتحسم صراعا على أرض النص وفضائه. رواية تساعدنا على الاكتشاف، تعرفنا تاريخنا ومن نحن، وماذا نريد، لأننا عندما نعرف نستطيع». د.كرمة سامي – جريدة الأهرام",
                        ISBN = "9789770928295",
                        AvailableCopies = 4,
                        Price = 310,
                  },
                  new Book
                  {
                        Title = "أخطاء التربية",
                        Description = "الأمومة فطرة أما التربية علم ودراسة ومهارة، يحتاج منا إلى فهم وقراءة. بخطوات سهلة وبعيدًا عن المصطلحات الأكاديمية المعقدة يقدم لكم هذا الكتاب كلَّ ما تبحثون عنه وتريدون معرفته عن أطفالكم. يطرح لكم هذا الكتاب عدة مفاتيح تساعدكم -بصفتكم مُربِّين- على فهم أطفالكم كما تكسبكم المهارة في تربيتهم. ",
                        ISBN = "9789779923758",
                        AvailableCopies = 1,
                        Price = 195,


                  },
                  new Book
                  {
                        Title = "رسائل من القرآن",
                        Description = "يا الله : إنكَ عندما قلتَ لإبراهيم عليه السلام: ﴿ وَأَذِّنْ فِي النَّاسِ بِالْحَجّ ﴾ قال لكَ: ربِّ كيف أُبلِّغُ الناس وصوتي لا يصلهم؟! فقلتَ له: عليكَ النِّداء وعلينا البلاغ! فبلغَ صوته أرجاء الأرض! فيا الله: هذا الكتاب نداء عبدٍ ضعيف القلب، ضعيف الصوت، ناداه حُباً لكَ، ورغبةً فيكَ، فأكرمه بالبلاغ!",
                        ISBN = "9789921768015",
                        AvailableCopies = 0,
                        Price = 490,
                  },
            };
            var Book2 = new List<Book>
            {
                  new Book
                  {
                        Title = "سيدة القرفة",
                        Description = "«في «سيدة القرفة»، تؤوِّل رحمة ضياء العالم عبر الطهي والمذاقات والنكهات. فالطهي في هذه الرواية الآسرة وسيلة لفهم العالم والتغلب على صعوباته، والتوابل تؤدي دور المرشد والدليل، ليس فقط لميمي، التي وجدت نفسها فجأة في مأزق لا قدرة لها على فهم أبعاده ولا سبر غموضه، بل أيضًا لأبيها ومعلمها الذي علَّمها لغة الخضراوات والأعشاب وأساطيرها. نعم، ربما الأسطرة هي المفردة الملائمة هنا، فمع أن الرواية واقعية تمامًا، إلّا أن المؤلفة تنجح برهافة في أسطرة الواقع وتحويله إلى واقع موازٍ تحتل فيه القرفة مكانة لا ينافسها عليها تابل آخر، وفي تشييد عالم روايتها بحساسية وذكاء، بلغة دقيقة سلسة لا تتخلى عن شعريتها».منصورة عز الدين",
                        ISBN = "9789770938805",
                        PublicationYear = new DateTime(2024, 5, 2),
                        AvailableCopies = 3,
                        Price = 350,
                  },
                  new Book
                  {
                        Title = "كم مرة سنبيع القمر",
                        Description = "تدورُ معظم قصص هذا الكتاب بين نيويورك ونيوجيرسي، في هذه النقطة البعيدة تمامًا عن الوطن، حيث يمكن تحويل كل الكائنات والجماد إلى أصدقاء. يبحث في الظلال والشوارع الخلفية عن حكايات تحول الوحدة إلى وَنَس يكتب عن هؤلاء الغُرباء الذين نقابلهم صدقة فنرى أنفسنا في أعينهم فنضحك أو نبكي.. لا يهم، لكننا مع كل قصة نعاود اكتشاف عالم ربما لم نُدرك وجوده أبدًا، رغم أننا جميعًا نعيشه بنفس الأحلام والحُب والأمل",
                        ISBN = "9789770938737",
                        PublicationYear = new DateTime(2023, 12, 24),
                        AvailableCopies = 3,
                        Price = 400,
                  },
                  new Book
                  {
                        Title = "لبنى والقرط اللازوردى",
                        Description = "بدأ كلُّ شيء من بيت الجدَّة حياة. فهي ليست ككل الجدَّات . وبيتها ليس كباقي البيوت. وما بين الماضي والحاضر.. يلمع القرطُ ويقول كلمته . يختار الفتيات الشجاعات، اللاتي على قول الحقيقة قادرات . هل ستوافق لبنى أن ترتديه لتُصبح إحدى وريثات القرط؟ . هذا ما سنعرفه.. جزءًا جزءًا حتى تكتمل الحكايةُ كاملة !" ,
                        ISBN = "9789770938959",
                        PublicationYear = new DateTime(2024, 5, 20),
                        AvailableCopies = 3,
                        Price = 300,
                  },
                  new Book
                  {
                        Title = "أوقاتى الحلوة",
                        Description = "بدأت وصفة سهلة فى عام 2001 كموقع على الإنترنت يهتم بتقديم وصفات جديدة متنوعة من جميع بلدان العالم ولكن متوافقة مع الذوق العربى. وسرعان ما تطورت الفكرة وتحول الموقع إلى دليل شامل للمرأة العصرية، يحتوى الآن على سبعة أقسام رئيسية هى: الصحة، الرشاقة، الجمال، الأطفال، الحمل، المنزل، أنتِ والآخرين وهو القسم الذى يهتم بعلاقة المرأة بكل من يحيط بها: الزوج، الأهل، الأولاد، رئيسها فى العمل وزملاؤها. هدفنا فى وصفة سهلة هو تقديم معلومات تساعدك فى حياتك اليومية لتجعلها أكثر سهولة، سواء فى إعداد الطعام، أو الاهتمام بالمنزل أو تربية الأطفال؛ ليتاح لكى الوقت للاهتمام بجمالك ورشاقتك",
                        ISBN = "9789770929965",
                        PublicationYear = new DateTime (2011, 1, 1),
                        AvailableCopies = 3,
                        Price = 150,
                  },
                  new Book
                  {
                        Title = "أكلات للريجيم",
                        Description = "بدأت وصفة سهلة فى عام 2001 كموقع على الإنترنت يهتم بتقديم وصفات جديدة متنوعة من جميع بلدان العالم ولكن متوافقة مع الذوق العربى. وسرعان ما تطورت الفكرة وتحول الموقع إلى دليل شامل للمرأة العصرية، يحتوى الآن على سبعة أقسام رئيسية هى: الصحة، الرشاقة، الجمال، الأطفال، الحمل، المنزل، أنتِ والآخرين وهو القسم الذى يهتم بعلاقة المرأة بكل من يحيط بها: الزوج، الأهل، الأولاد، رئيسها فى العمل وزملاؤها. هدفنا فى وصفة سهلة هو تقديم معلومات تساعدك فى حياتك اليومية لتجعلها أكثر سهولة، سواء فى إعداد الطعام، أو الاهتمام بالمنزل أو تربية الأطفال؛ ليتاح لكى الوقت للاهتمام بجمالك ورشاقتك.",
                        ISBN = "9789770920282",
                        PublicationYear = new DateTime (2007, 1, 1),
                        AvailableCopies = 3,
                        Price = 120
                  },
                  new Book
                  {
                        Title = "أحلى الأكلات الصحية للأطفال",
                        Description = "بدأت وصفة سهلة فى عام 2001 كموقع على الإنترنت يهتم بتقديم وصفات جديدة متنوعة من جميع بلدان العالم ولكن متوافقة مع الذوق العربى. وسرعان ما تطورت الفكرة وتحول الموقع إلى دليل شامل للمرأة العصرية، يحتوى الآن على سبعة أقسام رئيسية هى: الصحة، الرشاقة، الجمال، الأطفال، الحمل، المنزل، أنتِ والآخرين وهو القسم الذى يهتم بعلاقة المرأة بكل من يحيط بها: الزوج، الأهل، الأولاد، رئيسها فى العمل وزملاؤها. هدفنا فى وصفة سهلة هو تقديم معلومات تساعدك فى حياتك اليومية لتجعلها أكثر سهولة، سواء فى إعداد الطعام، أو الاهتمام بالمنزل أو تربية الأطفال؛ ليتاح لكى الوقت للاهتمام بجمالك ورشاقتك",
                        ISBN = "9789770924764",
                        PublicationYear = new DateTime (2009, 1, 9),
                        AvailableCopies = 3,
                        Price = 130,
                  },
                  new Book
                  {
                        Title = "حزب الكنبة",
                        Description = "قررت أن يكون «حزب الكنبة» هو عنوان أول كتاب لي وطبعًا هذه ليست ملحوظة عبقرية لأنكم بالفعل قد قرأتم العنوان على الغلاف. لقد سميت الكتاب بهذا الاسم نظرًا لأنها مقالتي الأشهر على مدونتي على الفيسبوك، والتي تم تداولها في العديد من المنتديات الحوارية، واكتسبت شهرة واسعة واكتسب مصلح «حزب الكنبة» شهرة واسعة اضيف لقاموس الحياة السياسية والاحتماعية المصرية . يُقصد بحزب الكنبة أولئك الجاثمون على صدور الثوار ويرددون كلام القنوات المصرية كالماسونية والثورات الخضراء والاستقرار، ويطلبون من نفس الثوار أن يدحرجوا عجلة الإنتاج لهم ويخلصوهم من الظلم، وأن يمنعوا الميكروباصات من الوقوف بعرض الطريق، وياريت لو يدهنوا الرصيف كل شهر، وناقص يطلبوا منهم يمسحوا لهم السلم. فإذا ما أخطأ المسئولون المُعينون من المجلس العسكري يعاير بعض أعضاء حزب الكنبة الثوار بالفشل ويشمتون فيهم ويقولون كلمتهم الأثيرة: الثوار خربوا البلد",
                        ISBN = "9789770930915",
                        PublicationYear = new DateTime (2017, 10, 1),
                        AvailableCopies = 7,
                        Price = 150,
                  },
                  new Book
                  {
                        Title = "أحلام المصريين",
                        Description = "الكتاب يقدم رؤية لأحلام المصريين ، بعد ان جابت كاتبته غالبية محافظات مصر. تتحدث «هند اسماعيل » مع أبناء هذا البلد من جميع التيارات ،الثقافات والافكار ففيه القاهرى، أبناء بحرى، الصعيد الجوانى. رجال سيوة وسيناء، نساء أسوان والإسكندرية، منهم من هو متعلم، ومن لم يجد حظه فى التعليم، المثقف ومن لم يقرأ كتابا واحدا، الحرفى ،الفلاح، العامل، أستاذ الجامعة ،الطالب والفنان.. الكل يطرح همومه ومشاكله، يقترح حلولها، ويعبر عن آلامه، آماله وأحلامه. والتأكيد على أن الزمن لن يعود إلى الوراء،هكذا هو الحلم، حلم العيش بكرامة. جميع النماذج التى أوردتها هند إسماعيل فى كتابها تزيح الستار وتجلى الغمام عن طاقات أمل ، نور ورغبة قوية فى النهوض، إن كانت مختبئة وراء أوجاع، هموم وآلام. كما يكشف الكتاب لكل محبط ويائس مما حدث بعد الثورة، أن الثورة تنجح عندما تحرر العقول والقلوب، إذا استطاعت أن تضىء النفق المظلم الذى تراه ممتدا بطول حياتك، الثورة لا تنجح بالإطاحة بالنظام فقط أو تغييره، ولا تفشل إن أعقب النظام المطاح به آخر لا يلبى أهدافها، لكن تفشل إذا لم تعيد أحلامنا ، توقظ آمالنا وتحرر العقول.",
                        ISBN = "9789770931615",
                        PublicationYear = new DateTime (2012, 11, 1),
                        AvailableCopies = 7,
                        Price = 180,
                  },
                  new Book
                  {
                        Title = "أسامة",
                        Description = "كيف تسنّى لـمليونير سعودى فى أواسط عمره أن يهدّد القوة العظمى الوحيدة فى العـالم؟ هذا هو محـور السـؤال فى كتاب جـوناثان رانـدل الأخـاذ حـول دور « أسـامة بن لادن »فى اندلاع نار الإرهاب فى الشرق الأوسط والعالم. تمتد خبرة المؤلف الصحفية بالشرق الأوسط على مدى أربعين سنة! وقد أوضح لنا فى كتابه هذا كيف تختصر حياة أسامة بن لادن الصدام الحتمى بين إسلام القرن الحادى والعشرين والغرب، واصفًا رحلة ابتعاده عن الغرب وعن «مملكة النفط» السعودية التى تشكل عائلته جزءًا لا يتجزأ منها. يستعرض المؤلف نشاط أسامة الإرهابى قبل الحادى عشر من سبتمبر 2001 ويرى فى شخصيته نموذجًا جديدًا غير مسبوق فى تاريخ الإرهاب المعاصر: رجل أعمال مستقل ذو ثروة، ينتشر أتباعه فى أرجاء العالم، مستنفرين لابتكار العمليات الإرهابية، يستكشف راندل ما عرضه أسامة على السعوديين من أن تتولى قوات «القاعدة» إخراج صدام حسين من الكويت فى العام 1991. وبعد أن يقتفى مصادر أسامة المالية، يعود ليخبرنا كيف تحولت حرب العراق إلى أداة فى أيدى الإرهابيين، ينبثق نص راندل من مصادره الموثوقة فى الشرق الأوسط وفهمه العميق لهذه المنطقة، وهو أوضح كتاب حول كل التساؤلات المحيطة بشخص يشكل أبرز بؤرة رعب فى العالم. ",
                        ISBN = "6221102014915",
                        PublicationYear = new DateTime (2004, 8, 1),
                        AvailableCopies = 7,
                        Price = 650,
                  },
                  new Book
                  {
                        Title = "نافذة مستديرة لضوء القمر",
                        Description = "بلغة شاعرية وشخصيات جذابة وفريدة بغرابة أطوارها، تحكي رواية «نافذة مستديرة لضوء القمر» عن فنان تشكيلي يتعرض لأزمات في حياته الشخصية والمهنية. يشعر بالضياع والوحدة والإحباط، ويقرر الهروب من كل شيء والسفر إلى أماكن لم يسمع عنها من قبل.\r\nوفي إحدى رحلاته، يشعر بالارتياح لواحدة من المدن التي زارها فيقرر أن يطيل بقاءه فيها؛ ليلتقي بأشخاص جدد ويخوض تجارب غريبة ومثيرة، تغير نظرته للحياة ولنفسه. لكن هل سيجد مساحة الأمان التي يبحث عنها، أم سيواجه مخاطر أكبر ممَّا ترك خلفه؟",
                        PublicationYear = new DateTime (2024, 1, 24),
                        AvailableCopies = 7,
                        Price = 350,

                  },
            };
            var Books = new List<List<Book>>
            {
                Book1,
                Book2
            };

            foreach (var miniBooks in Books)
            {
                foreach (var Book in miniBooks)
                {
                    if (!_context.Books.Any(b => b.Title == Book.Title))
                    {
                        _context.Books.Add(Book);
                    }
                }
            }
        }
        private void SeedAuthor()
        {
            var Authors1 = new List<Author> {
                    new Author
                    {
                        FullName = "Elizabeth Lim",
                    },
                    new Author
                     {
                         FullName = "leo tolstoy",
                     },
                    new Author
                    {
                        FullName = "سمر طاهر",
                    },
                    new Author
                    {
                        FullName = "منى يونس",
                    },
                    new Author
                    {
                        FullName = "رضوى عاشور",
                    },
                    new Author
                    {
                        FullName = "شيماء علي",
                    },
                    new Author
                    {
                        FullName = "أدهم شرقاوى",
                    },
            };
            var Authors2 = new List<Author>
            {
                    new Author
                    {
                        FullName = " رحمة ضياء",
                    },
                    new Author
                    {
                        FullName = "عزت امين",
                    },
                    new Author
                    {
                        FullName = "هند إسماعيل",
                    },
                    new Author
                    {
                        FullName = "جوناثان راندل",
                    },
                    new Author
                    {
                        FullName = "محمود عبده",
                    },
                    new Author
                    {
                        FullName = "أسامة علام",
                    },
                    new Author
                    {
                        FullName = "رشا سنبل",
                    },
                    new Author
                    {
                        FullName = "وصفة سهلة",

                    },
            };
            var Authors = new List<List<Author>>
            {
                  Authors1,
                  Authors2,
            };

            foreach (var miniAuthor in Authors)
            {
                foreach (var author in miniAuthor)
                {
                    if (!_context.Authors.Any(a => a.FullName == author.FullName))
                    {
                        _context.Authors.Add(author);
                    }
                }
            }
        }
        private void SeedBookAuthor()
        {
            var BookAuthor1 = new List<BookAuthor> {
                new BookAuthor
                {
                    BookId = 3,
                    AuthorId = 1
                },
                new BookAuthor
                {
                    BookId = 4,
                    AuthorId = 1
                },
                new BookAuthor
                {
                    BookId = 5,
                    AuthorId = 2
                },
                new BookAuthor
                {
                    BookId = 6,
                    AuthorId = 2
                },
                new BookAuthor
                {
                    BookId = 7,
                    AuthorId = 3
                },
                new BookAuthor
                {
                    BookId = 8,
                    AuthorId = 4
                },
                new BookAuthor
                {
                    BookId = 9,
                    AuthorId = 5
                },
                new BookAuthor
                {
                    BookId = 10,
                    AuthorId = 6
                },
            };
            var BookAuthor2 = new List<BookAuthor> {
                new BookAuthor
                {
                    BookId = 11,
                    AuthorId = 7
                },
                new BookAuthor
                {
                    BookId = 12,
                    AuthorId = 8
                },
                new BookAuthor
                {
                    BookId = 13,
                    AuthorId = 9
                },
                new BookAuthor
                {
                    BookId = 14,
                    AuthorId = 10
                },
                new BookAuthor
                {
                    BookId = 15,
                    AuthorId = 10
                },
                new BookAuthor
                {
                    BookId = 16,
                    AuthorId = 10
                },
                new BookAuthor
                {
                    BookId = 17,
                    AuthorId = 11
                },
                new BookAuthor
                {
                    BookId = 18,
                    AuthorId = 12
                },
                new BookAuthor
                {
                    BookId = 19,
                    AuthorId = 13
                },
                new BookAuthor
                {
                    BookId = 20,
                    AuthorId = 14
                },

            };

            var bookAuthors = new List<List<BookAuthor>>
            {
              BookAuthor1,
              BookAuthor2,
            };

            foreach (var miniBookAuthor in bookAuthors)
            {
                foreach (var bookAuthor in miniBookAuthor)
                {
                    if (!_context.BookAuthors.Any(ba => ba.BookId == bookAuthor.BookId && ba.AuthorId == bookAuthor.AuthorId))
                    {
                        _context.BookAuthors.Add(bookAuthor);
                    }
                }
            }
        }
    }
}
